# EDA

## Dependencies

In [1]:
import pandas as pd
import numpy as np

## Data

In [7]:
Mteams = pd.read_csv("../data/Mteams.csv")
Mteams.head()

   TeamID     TeamName  FirstD1Season  LastD1Season
0    1101  Abilene Chr           2014          2025
1    1102    Air Force           1985          2025
2    1103        Akron           1985          2025
3    1104      Alabama           1985          2025
4    1105  Alabama A&M           2000          2025

In [5]:
WTeams  = pd.read_csv("../data/Wteams.csv")
WTeams.head()

   TeamID     TeamName
0    3101  Abilene Chr
1    3102    Air Force
2    3103        Akron
3    3104      Alabama
4    3105  Alabama A&M

In [17]:
MSeasons = pd.read_csv('../data/MSeasons.csv')
WSeasons = pd.read_csv('../data/WSeasons.csv')

In [18]:
MSeasons.head()

   Season     DayZero RegionW    RegionX    RegionY    RegionZ
0    1985  10/29/1984    East       West    Midwest  Southeast
1    1986  10/28/1985    East    Midwest  Southeast       West
2    1987  10/27/1986    East  Southeast    Midwest       West
3    1988  11/02/1987    East    Midwest  Southeast       West
4    1989  10/31/1988    East       West    Midwest  Southeast

In [19]:
WSeasons.head()

   Season     DayZero RegionW  RegionX  RegionY  RegionZ
0    1998  10/27/1997    East  Midwest  Mideast     West
1    1999  10/26/1998    East  Mideast  Midwest     West
2    2000  11/01/1999    East  Midwest  Mideast     West
3    2001  10/30/2000    East  Midwest  Mideast     West
4    2002  10/29/2001    East     West  Mideast  Midwest

## Data Analysis

<h5>Mteams</h5>

In [8]:
Mteams.columns

Index(['TeamID', 'TeamName', 'FirstD1Season', 'LastD1Season'], dtype='object')

In [9]:
list(set(Mteams['LastD1Season']))

[1985,
 1986,
 1987,
 2019,
 1990,
 1991,
 1992,
 2025,
 2023,
 1998,
 2003,
 2006,
 2010,
 2011]

In [10]:
Mteams = Mteams[Mteams['LastD1Season'] == 2025]

   TeamID     TeamName  FirstD1Season  LastD1Season
0    1101  Abilene Chr           2014          2025
1    1102    Air Force           1985          2025
2    1103        Akron           1985          2025
3    1104      Alabama           1985          2025
4    1105  Alabama A&M           2000          2025

In [11]:
Mteams.shape

(364, 4)

In [13]:
len(list(set(Mteams['TeamName'])))

364

In [14]:
list(set(Mteams['FirstD1Season']))

[1985,
 1986,
 1987,
 1988,
 1989,
 1990,
 1991,
 1992,
 1993,
 1994,
 1995,
 1996,
 1998,
 1999,
 2000,
 2002,
 2003,
 2005,
 2006,
 2007,
 2008,
 2009,
 2012,
 2013,
 2014,
 2019,
 2020,
 2021,
 2022,
 2023,
 2024,
 2025]

In [15]:
Mteams.groupby('FirstD1Season').count()

               TeamID  TeamName  LastD1Season
FirstD1Season
1985              272       272           272
1986                3         3             3
1987                7         7             7
1988                2         2             2
1989                3         3             3
1990                1         1             1
1991                2         2             2
1992                5         5             5
1993                1         1             1
1994                2         2             2
1995                1         1             1
1996                3         3             3
1998                1         1             1
1999                5         5             5
2000                8         8             8
2002                2         2             2
2003                4         4             4
2005                4         4             4
2006                4         4             4
2007                2         2             2
2008                5         5             5
2009                5         5             5
2012                1         1             1
2013                1         1             1
2014                4         4             4
2019                2         2             2
2020                1         1             1
2021                4         4             4
2022                1         1             1
2023                5         5             5
2024                1         1             1
2025                2         2             2

<h5>MSeasons</h5>

In [20]:
MSeasons.columns

Index(['Season', 'DayZero', 'RegionW', 'RegionX', 'RegionY', 'RegionZ'], dtype='object')

In [21]:
MSeasons.describe()

            Season
count    41.000000
mean   2005.000000
std      11.979149
min    1985.000000
25%    1995.000000
50%    2005.000000
75%    2015.000000
max    2025.000000

In [22]:
MSeasons.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41 entries, 0 to 40
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Season   41 non-null     int64
 1   DayZero  41 non-null     object
 2   RegionW  41 non-null     object
 3   RegionX  41 non-null     object
 4   RegionY  41 non-null     object
 5   RegionZ  41 non-null     object
dtypes: int64(1), object(5)
memory usage: 2.0+ KB

In [25]:
(list(set(MSeasons['DayZero'])))

['11/03/2014',
 '11/05/2007',
 '10/31/1994',
 '10/31/1988',
 '10/30/2000',
 '10/30/1995',
 '11/01/2010',
 '10/27/1997',
 '11/05/2012',
 '11/03/2008',
 '11/02/1987',
 '10/29/1984',
 '10/30/1989',
 '10/28/1996',
 '10/27/1986',
 '10/31/2011',
 '11/02/1992',
 '11/02/2015',
 '11/02/2020',
 '11/04/2002',
 '11/03/2003',
 '11/01/2004',
 '11/01/1993',
 '10/28/1985',
 '10/30/2006',
 '10/26/1998',
 '11/01/2021',
 '10/31/2022',
 '11/04/2024',
 '10/31/2005',
 '11/04/2019',
 '11/04/2013',
 '10/30/2017',
 '10/29/2001',
 '10/31/2016',
 '11/06/2023',
 '11/04/1991',
 '11/01/1999',
 '11/02/2009',
 '10/29/1990',
 '11/05/2018']